In [5]:
import numpy as np

In [14]:
a=np.array(['banana',42])
print(a,type(a))
s=pd.Series(a,index=['a','b'])
print(s)

['banana' '42'] <class 'numpy.ndarray'>
a    banana
b        42
dtype: object

In [11]:
import pandas as pd

In [ ]:
s={'coll':[1,2]}
df=pd.DataFrame(s)
df

In [ ]:
print(type(df))

In [25]:
df=[[1,2,3],[5,6,3]]
df1=pd.DataFrame(df,columns=['col1','col2','col3'])

In [26]:
df1

   col1  col2  col3
0     1     2     3
1     5     6     3

In [27]:
df=np.array([[1,2,3],[5,3,4]])
df2=pd.DataFrame(df,columns=['col1','col2','col3'])
df2

   col1  col2  col3
0     1     2     3
1     5     3     4

In [28]:
temp_df=pd.DataFrame({'city':['num','del','bang','hyd'],'temp':[32,43,23,54]})
temp_df

   city  temp
0   num    32
1   del    43
2  bang    23
3   hyd    54

In [31]:
hum_df=pd.DataFrame({'city':['mum','del','hyd','chen'],'temp':[65,34,45,76]})
hum_df

   city  temp
0   mum    65
1   del    34
2   hyd    45
3  chen    76

In [38]:
pd.concat([temp_df,hum_df])

   city  temp
0   num    32
1   del    43
2  bang    23
3   hyd    54
0   mum    65
1   del    34
2   hyd    45
3  chen    76

In [42]:
pd.concat([temp_df,hum_df],ignore_index=True
         )

   city  temp
0   num    32
1   del    43
2  bang    23
3   hyd    54
4   mum    65
5   del    34
6   hyd    45
7  chen    76

In [43]:
pd.concat([temp_df,hum_df],axis=1)

   city  temp  city  temp
0   num    32   mum    65
1   del    43   del    34
2  bang    23   hyd    45
3   hyd    54  chen    76

In [44]:
pd.merge(temp_df,hum_df,on='city',how='inner')

  city  temp_x  temp_y
0  del      43      34
1  hyd      54      45

In [47]:
df.shape

(2, 3)

In [48]:
df.size

6

In [62]:
df = pd.read_clipboard()
df

    #   For            clipboard  paste  (after  copying  from  Excel)
0  df     =  pd.read_clipboard()    NaN     NaN      NaN   NaN     NaN
1  df  None                 None    NaN     NaN      NaN   NaN     NaN

In [64]:
df.columns

Index(['#', 'For', 'clipboard', 'paste', '(after', 'copying', 'from',
       'Excel)'],
      dtype='object')

In [65]:
df.keys()

Index(['#', 'For', 'clipboard', 'paste', '(after', 'copying', 'from',
       'Excel)'],
      dtype='object')

In [66]:
df.dtypes

#             object
For           object
clipboard     object
paste        float64
(after       float64
copying      float64
from         float64
Excel)       float64
dtype: object

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   #          2 non-null      object
 1   For        1 non-null      object
 2   clipboard  1 non-null      object
 3   paste      0 non-null      float64
 4   (after     0 non-null      float64
 5   copying    0 non-null      float64
 6   from       0 non-null      float64
 7   Excel)     0 non-null      float64
dtypes: float64(5), object(3)
memory usage: 260.0+ bytes

In [68]:
df.tail()

    #   For            clipboard  paste  (after  copying  from  Excel)
0  df     =  pd.read_clipboard()    NaN     NaN      NaN   NaN     NaN
1  df  None                 None    NaN     NaN      NaN   NaN     NaN

In [69]:
df.iloc[0]

#                             df
For                            =
clipboard    pd.read_clipboard()
paste                        NaN
(after                       NaN
copying                      NaN
from                         NaN
Excel)                       NaN
Name: 0, dtype: object

In [70]:
df.iloc[-1]

#              df
For          None
clipboard    None
paste         NaN
(after        NaN
copying       NaN
from          NaN
Excel)        NaN
Name: 1, dtype: object

In [78]:
df.iloc[1,4]

nan

In [85]:
df.iloc[1,2]

In [89]:
df.iloc[[1,1],[2,1,1,]]

  clipboard   For   For
1      None  None  None
1      None  None  None

In [90]:
df.iloc[0:3,0:2]

    #   For
0  df     =
1  df  None

In [91]:
df.loc[0]

#                             df
For                            =
clipboard    pd.read_clipboard()
paste                        NaN
(after                       NaN
copying                      NaN
from                         NaN
Excel)                       NaN
Name: 0, dtype: object

df.loc[[1,2]]

In [93]:
df.loc[[1,1]]

    #   For clipboard  paste  (after  copying  from  Excel)
1  df  None      None    NaN     NaN      NaN   NaN     NaN
1  df  None      None    NaN     NaN      NaN   NaN     NaN

In [106]:
df.iloc[[1,1]]

    #   For clipboard  paste  (after  copying  from  Excel)
1  df  None      None    NaN     NaN      NaN   NaN     NaN
1  df  None      None    NaN     NaN      NaN   NaN     NaN

In [101]:
df.iloc[[1,1],[1,2,3,4,5,6]]

    For clipboard  paste  (after  copying  from
1  None      None    NaN     NaN      NaN   NaN
1  None      None    NaN     NaN      NaN   NaN

In [107]:
df.iloc[0:3,0:2]

    #   For
0  df     =
1  df  None